_posts/2022-01-15-abc235-d-upsolving.html
---
title: abc235 D - Multiply and Rotate
tags: AtCoder BFS
toc: true
toc_sticky: true
---

<div id="outline-container-org823890f" class="outline-2">
<h2 id="org823890f">D - Multiply and Rotate</h2>
</div>

<div id="outline-container-org786c106" class="outline-2">
<h2 id="org786c106">접근하기</h2>
<div class="outline-text-2" id="text-org786c106">
<pre class="example">
- BFS로 weight가 같을 때, 최단거리를 구할 수 있음
- but, 숫자를 뒤집는 조건이 추가됨
  - 숫자가 작아질 가능성이 있음 -&gt; 무한루프?

- 이 조건은 생각하기 어려웠음.
  - 뒤집어도 원래 값보다 커져야 한다.
    - 2자리수 이상이어야 한다.
    - num%10 == 0인 경우, 10, 100, 1000 등은 뒤집으면 작아지므로 제외

- visit 배열로 한번 접근한 값은 제외

- BFS
</pre>
</div>
</div>

<div id="outline-container-org229e7a1" class="outline-2">
<h2 id="org229e7a1">코드 84 m/s</h2>
<div class="outline-text-2" id="text-org229e7a1">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;bits/stdc++.h&gt;</span>
<span style="color: #729fcf; font-weight: bold;">using</span> <span style="color: #729fcf; font-weight: bold;">namespace</span> <span style="color: #8ae234;">std</span>;

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">a</span>;
<span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">N</span>;
<span style="color: #729fcf; font-weight: bold;">typedef</span> <span style="color: #729fcf; font-weight: bold;">struct</span> <span style="color: #8ae234; font-weight: bold;">Node</span> {
    <span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #ff6347;">num</span>;
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">dist</span>;
} <span style="color: #8ae234; font-weight: bold;">Node</span>;

<span style="color: #8ae234; font-weight: bold;">queue</span>&lt;<span style="color: #8ae234; font-weight: bold;">Node</span>&gt; <span style="color: #ff6347;">q</span>;
<span style="color: #8ae234; font-weight: bold;">map</span>&lt;<span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #8ae234; font-weight: bold;">long</span>, <span style="color: #8ae234; font-weight: bold;">int</span>&gt; <span style="color: #ff6347;">visited</span>;  <span style="color: #888a85;">// </span><span style="color: #888a85;">&#45712;&#47548; vector&#47196; &#48148;&#44984;&#47732; &#48736;&#47492;</span>

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    scanf(<span style="color: #ad7fa8; font-style: italic;">"%d %lld"</span>, &amp;a, &amp;N);
 <span style="color: #888a85;">//   </span><span style="color: #888a85;">vector&lt;int&gt; visited(1000000, 0);</span>

    q.push({1, 0});
    visited[1] = 1;

    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">ans</span> = -1;
    <span style="color: #729fcf; font-weight: bold;">while</span>(!q.empty()) {
        <span style="color: #8ae234; font-weight: bold;">Node</span> <span style="color: #ff6347;">cur</span> = q.front(); q.pop();
        visited[cur.num] = 1;
        <span style="color: #729fcf; font-weight: bold;">if</span> (cur.num == N) {
            ans = cur.dist;
            <span style="color: #729fcf; font-weight: bold;">break</span>;
        }

        <span style="color: #729fcf; font-weight: bold;">if</span> (1000000 &gt; cur.num * a) {
            <span style="color: #729fcf; font-weight: bold;">if</span>(visited[cur.num*a] == 0) {
                visited[cur.num*a] = 1;
                q.push({cur.num*a, cur.dist+1});
            }
        } 
        <span style="color: #888a85;">// </span><span style="color: #888a85;">&#46160;&#51088;&#47551; &#49688; &#51060;&#49345;,</span>
        <span style="color: #888a85;">// </span><span style="color: #888a85;">&#46244;&#51665;&#50632;&#51012;&#46412; &#51687;&#50500;&#51648;&#51648; &#50506;&#51004;&#47140;&#47732;, 10 100 &#52376;&#47100;&#46104;&#47732; &#50504;&#46120;</span>
        <span style="color: #729fcf; font-weight: bold;">if</span> (cur.num &gt;= 10 &amp;&amp; cur.num%10 != 0) {
            <span style="color: #8ae234; font-weight: bold;">string</span> <span style="color: #ff6347;">S</span> = to_string(cur.num);
            rotate(S.begin(), S.end() - 1, S.end());
            <span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #ff6347;">rnum</span> = stoi(S);
            <span style="color: #729fcf; font-weight: bold;">if</span>(visited[rnum] == 0) {
                visited[rnum] = 1;
                q.push({rnum, cur.dist+1});
            }
        }
    }
    printf(<span style="color: #ad7fa8; font-style: italic;">"%d\n"</span>, ans);
}
</pre>
</div>
</div>
</div>


<div id="outline-container-orgc016493" class="outline-2">
<h2 id="orgc016493">코드 31 m/s</h2>
<div class="outline-text-2" id="text-orgc016493">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #888a85;">// </span><span style="color: #888a85;">&#50948; &#53076;&#46300;&#50640;&#49436;</span>

<span style="color: #888a85;">//</span><span style="color: #888a85;">map&lt;long long, int&gt; visited;  // &#45712;&#47548; vector&#47196; &#48148;&#44984;&#47732; &#48736;&#47492;</span>

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>() {
<span style="color: #888a85;">// </span><span style="color: #888a85;">map -&gt; vector&#47196; &#48148;&#44984;&#44256;, &#48120;&#47532; &#53356;&#44592;&#47484; &#51648;&#51221;&#54616;&#47732; &#48736;&#47492;</span>
    <span style="color: #8ae234; font-weight: bold;">vector</span>&lt;<span style="color: #8ae234; font-weight: bold;">int</span>&gt; <span style="color: #ff6347;">visited</span>(1000000, 0);
</pre>
</div>
</div>
</div>

<div id="outline-container-org50afa29" class="outline-2">
<h2 id="org50afa29">문제 링크</h2>
<div class="outline-text-2" id="text-org50afa29">
<ul class="org-ul">
<li><a href="https://atcoder.jp/contests/abc235/tasks/abc235_d">https://atcoder.jp/contests/abc235/tasks/abc235_d</a></li>
</ul>
</div>
</div>
